{
"first_p": "Hey there, thank you for visiting the site. I really appreciate you being here. I’m an IT professional that spent most of my Covid learning networking and cybersecurity. This helped me to get a job after coming back from teaching in China. I'm the type of person that fully throws themselves into any project and when I was working on my IT certs, I was studying all day every day especially when I got put on the graveyard shift.",
"second_p": "Eventually I got to a more normal schedule and took some time for myself, but as I was working on more systems, I was looking at ways to shave time down from my job and of course automation was at the forefront of my mind. I pitched it to my boss to automate our new computer setup. At this point I thought I could cobble together something with system images and a few scripts but kept running into problems especially with our computer management software.",
"third_p": "Finally, I had to face the truth, I needed control over the computer and chose to pick up Python. Since then, the project has been shot down by my bosses’ boss, but I kept with the coding. My journey has been learning algorithms, engaging with the Baltimore coding community, and starting to pick up other languages. At the time of writing, I love Python but have branched out into C++ for microcontrollers and JS/React for building this website. Focusing on learning the best tool for the job. I am fully self-taught with help here and there from my friends at Baltimore Code and Coffee. I think this journey has given me a unique perspective where if I see a problem I can tackle it with new tools and I'm not scared to get into the weeds or completely overhaul something that I found out is not optimal down the line. Overall, I am jumping into machine learning, neural networks, and web scraping as they interest me the most.",
"magic_p": "Outside of coding I would say I am a bit of the stereotypical nerd who socializes. One of my favorite hobbies is Magic: The Gathering. I have been playing since college and its always fun to build commander decks and see what cool stuff you can do. In my heart I am a combo player who likes to build engines that make people scratch there head. My current project has been breaking Jadzi, Oracle of Arcavios//Journey to the Oracle. I love seeing the evolution of the deck from landfall, to ramp/control, to now self-mill graveyard recursion with a commander everyone had written off and I have found allows for great flexibility with getting extra value from control spells and using out of the box thinking that protects my commander by obfuscation. I have had many a player ask me to run through how I kill them since it requires me bouncing my own lands for infinite mana with Journey to the Oracle, then flipping over to Jadzi, Oracle of Arcavios to spell cascade into threats or just infinitely recur them with mystic sanctuary bouncing.",
"vg_p":"Not surprisingly I am a fan of video games. Some of my favorites are Call of Duty, Endless Legend, Street Fighter, and tons of indie stuff. I was ranked in the top 5% for MW1 remake by points per match. I found this out from a friend who was looking up stats because he loved the pro scene. I am still in the top list of Heavy from TF2 even after years of not playing, and I am having a blast figuring out SF6 combos. I would call most of my playstyles anti-meta. I can seem to always find a way to counter what is the most popular strategy, minus truly broken stuff, in a way that doesn’t compromise against other niche ideas.",
"startrek_p": "Lastly, I am a big Star Trek nerd. I didn’t think it was that bad as I would just watch whenever I was job seeking or in my off time, but I have come to terms I am in deep. How deep you ask? I have seen Star Trek: Enterprise and was able to make the connection instantly to Star Trek Beyond. I love the tech and optimism for the future Star Trek has. Its so interesting seeing how it also tries to deal with the balance of human nature with the questions of scientific ethics like “Do more scientifically advanced races have the obligation to allow less scientifically advanced races to develop naturally, no matter the consequences?”"


}